public class Main {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
        //переменной dog значение 8.0;переменной cat значение 3.6;
        // переменной paper значение 763789.Вывести значения в консоль
        var dog = 8.0;
        var cat = 3.6;
        var paper = 763789;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        //Увеличьте значение каждой перечисленной в прошлой задаче переменной на 4.
        //Для решения этой задачи используйте тип переменной var.
        //Выведите в консоль новые значения переменных.
        System.out.println();
        dog = 8.0 + 4;
        cat = 3.6 + 4;
        paper = 763789 + 4;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
    }
}