public class Main {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
        //переменной dog значение 8.0;переменной cat значение 3.6;
        // переменной paper значение 763789.Вывести значения в консоль
        var dog = 8.0;
        var cat = 3.6;
        var paper = 763789;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        //Увеличьте значение каждой перечисленной в прошлой задаче переменной на 4.
        //Для решения этой задачи используйте тип переменной var.
        //Выведите в консоль новые значения переменных.
        System.out.println();
        dog = 8.0 + 4;
        cat = 3.6 + 4;
        paper = 763789 + 4;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        //dog уменьшить на 3.5; cat уменьшить на 1.6; paper уменьшить на 7639
        //Выведите в консоль новые значения переменных
        System.out.println();
        dog = dog - 3.5;
        cat = cat - 1.6;
        paper = paper - 7639;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        //Инициализируйте (присвойте значение) переменную friend значением 19
        //Увеличьте значение переменной на 2, после чего поделите значение на 7
        //После каждой операции выводите значение переменной в консоль.
        // В итоге у вас должно быть выведено 3 значения одной переменной.
        //Для решения этой задачи используйте тип переменной var
        System.out.println();
        var friend = 19;
        System.out.println(friend);
        friend = friend + 2;
        System.out.println(friend);
        friend = friend / 7;
        System.out.println(friend);
        //Инициализируйте переменную frog значением 3.5
        //Увеличьте переменную в 10 раз и поделите на 3.5.
        // Добавьте к последнему значению переменной 4.
        //После каждой операции выводите значение переменной в консоль.
        // В итоге у вас должно быть выведено 4 значения одной переменной.
        //Для решения этой задачи используйте тип переменной var.
        System.out.println();
        var frog = 3.5;
        System.out.println(frog);
        frog = frog * 10;
        System.out.println(frog);
        frog = frog / 3.5;
        System.out.println(frog);
        frog = frog + 4;
        System.out.println(frog);
    }
}